package days01;

/**
 * @author yusica
 * @data 2024. 12. 23. - 오후 4:20:27
 * @subject 자바 식별자 명명 규칙
 * @content 
		// 문자로 시작해야 합니다. 숫자 시작 x
		// 대소문자를 구분합니다.
		// 예약어를 사용할 수 없습니다.
		// 특수문자는 _(밑줄)과 $(달러 기호)만 사용할 수 있습니다
		// 공백을 포함할 수 없습니다.
 */
public class Ex05 {
	
	public static void main(String[] args) {
		// [자바 식별자 명명 규칙]
		// 문자로 시작해야 합니다. 숫자 시작 x
		// 대소문자를 구분합니다.
		// 예약어를 사용할 수 없습니다.
		// 특수문자는 _(밑줄)과 $(달러 기호)만 사용할 수 있습니다
		// 공백을 포함할 수 없습니다.
		

	}// main

}// class
