package days07;

public class Ex01 {

	public static void main(String[] args) {
		/*
		 * 1. 메소드(함수) 정의? 프로그래밍에서 [반복되는 명령어들]을
		 * 			method			찾아서 별도로 묶어서 필요할 때마다
		 * 								불러서 사용할 수 있도록 한 것.
		 * 2. 프로그램의 구조화 -> 유지 보수 용이
		 * 		반복되는 코딩을 구조화 -> 재사용
		 * 3. 구조적 프로그래밍 언어(함수 기본) : C 언어
		 * 4. 메서드(함수) 선언 형식
		 * 			수정자(modifier)
		 * 		[접근지정자] [기타지정자] 리턴자료형 함수명([매개변수..]) // 함수 원형 == 프로토타입
		 * 		{		// 함수의 몸체
		 * 			[return 리턴값;]
		 * 		}
		 * 5. 함수 3가지 이해
		 * 		1) 기능
		 * 		2) 매개변수
		 * 		3) 리턴값( 리턴자료형 )	
		 * */

	}// main

}
